# Taps
tap "qmk/qmk"
tap "osx-cross/arm" # For QMK dependencies

# Formulae
brew "act"
brew "cloud-sql-proxy"
brew "cocoapods"
brew "devcontainer"
brew "dive"
brew "exiftool"
brew "fastlane"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-standup"
brew "gnupg"
brew "gptfdisk"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "ledger"
brew "mas"
brew "massren"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "node"
brew "ripgrep"
brew "rust"
brew "scc"
brew "tree"
brew "trippy"
brew "yazi"
brew "terraform"
brew "opencode"
brew "arm-gcc-bin" # QMK dependency
brew "avr-gcc" # QMK dependency
brew "dos2unix" # QMK dependency
brew "qmk/qmk/qmk"

# Casks
cask "android-studio"
cask "blender"
cask "cap"
cask "datagrip"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "handbrake-app"
cask "iina"
cask "insta360-link-controller"
cask "meetingbar"
cask "obs"
cask "orcaslicer"
cask "pearcleaner"
cask "proxyman"
cask "transmission"
cask "zulu@17"
cask "opencode-desktop"
cask "zed"

# Mac App Store Apps
mas "BlueWallet", id: 1376878040
mas "Clean Links", id: 6747395062
mas "Codepoint", id: 6444068649
mas "GarageBand", id: 682658836
mas "GoodLinks", id: 1474335294
mas "Hand Mirror", id: 1502839586
mas "HomePass", id: 1330266650
mas "Keynote", id: 409183694
mas "Mic Drop", id: 1489816366
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "Slack", id: 803453959
mas "Swift Playground", id: 1496833156
mas "WhatsApp", id: 310633997
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434
mas "uBlock Origin Lite", id: 6745342698
