{
  "plugins": {
    "blink-cmp": {
      "src": "github:saghen/blink.cmp",
      "version": "1.0.0 - 2.0.0"
    },
    "bufferline": {
      "src": "github:akinsho/bufferline.nvim",
      "version": "4.0.0 - 5.0.0"
    },
    "catppuccin": {
      "src": "github:catppuccin/nvim"
    },
    "chezmoi": {
      "src": "github:alker0/chezmoi.vim"
    },
    "color-converter": {
      "src": "github:NTBBloodbath/color-converter.nvim"
    },
    "conform": {
      "src": "github:stevearc/conform.nvim"
    },
    "diffview": {
      "src": "github:sindrets/diffview.nvim"
    },
    "early-retirement": {
      "src": "github:chrisgrieser/nvim-early-retirement"
    },
    "eyeliner": {
      "src": "github:jinh0/eyeliner.nvim"
    },
    "flash": {
      "src": "github:folke/flash.nvim"
    },
    "gitsigns": {
      "src": "github:lewis6991/gitsigns.nvim"
    },
    "grug-far": {
      "src": "github:MagicDuck/grug-far.nvim"
    },
    "highlight-colors": {
      "src": "github:brenoprata10/nvim-highlight-colors"
    },
    "lazydev": {
      "src": "github:folke/lazydev.nvim"
    },
    "lsp-config": {
      "src": "github:neovim/nvim-lspconfig"
    },
    "lspconfig": {
      "src": "github:neovim/nvim-lspconfig"
    },
    "mason": {
      "src": "github:mason-org/mason.nvim"
    },
    "mason-lsp-config": {
      "src": "github:mason-org/mason-lspconfig.nvim"
    },
    "mason-lspconfig": {
      "src": "github:mason-org/mason-lspconfig.nvim"
    },
    "mason-tool-installer": {
      "src": "github:WhoIsSethDaniel/mason-tool-installer.nvim"
    },
    "mini-icons": {
      "src": "https://github.com/nvim-mini/mini.icons",
      "version": ">=0.0.0"
    },
    "mini-indentscope": {
      "src": "github:nvim-mini/mini.indentscope",
      "version": ">=0.0.0"
    },
    "mini-pairs": {
      "src": "github:nvim-mini/mini.pairs",
      "version": ">=0.0.0"
    },
    "qmk": {
      "src": "github:codethread/qmk.nvim"
    },
    "render-markdown": {
      "src": "github:meanderingprogrammer/render-markdown.nvim"
    },
    "schema-store": {
      "src": "github:b0o/SchemaStore.nvim"
    },
    "scope": {
      "src": "github:tiagovla/scope.nvim"
    },
    "snacks": {
      "src": "github:folke/snacks.nvim"
    },
    "surround": {
      "src": "github:kylechui/nvim-surround",
      "version": ">=0.0.0"
    },
    "treesitter": {
      "src": "github:nvim-treesitter/nvim-treesitter"
    },
    "treesitter-auto-tag": {
      "src": "github:windwp/nvim-ts-autotag"
    },
    "treesitter-context": {
      "src": "github:nvim-treesitter/nvim-treesitter-context"
    },
    "treesitter-text-objects": {
      "src": "github:nvim-treesitter/nvim-treesitter-textobjects"
    },
    "ts-error-translator": {
      "src": "github:dmmulroy/ts-error-translator.nvim"
    },
    "windovigation": {
      "src": "github:volskaya/windovigation.nvim"
    }
  }
}
