EditorConfig.EditorConfig
Equinusocio.vsc-material-theme
PKief.material-icon-theme
christian-kohler.path-intellisense
codezombiech.gitignore
dbaeumer.vscode-eslint
esbenp.prettier-vscode
felipecaputo.git-project-manager
flowtype.flow-for-vscode
formulahendry.auto-rename-tag
kumar-harsh.graphql-for-vscode
naumovs.color-highlight
robinbentley.sass-indented
sysoev.language-stylus
vscodevim.vim
