{
  "arbor": { "branch": "trunk" },
  "autopairs": { "branch": "master" },
  "bufferline": { "branch": "main" },
  "catppuccin": { "branch": "main" },
  "cmp": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-calc": { "branch": "main" },
  "cmp-lsp": { "branch": "main" },
  "cmp-lsp-signature-help": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "color-converter": { "branch": "main" },
  "conform": { "branch": "master" },
  "copilot": { "branch": "master" },
  "devicons": { "branch": "master" },
  "diffview": { "branch": "main" },
  "early-retirement": { "branch": "main" },
  "eyeliner": { "branch": "main" },
  "gitsigns": { "branch": "main" },
  "grug-far": { "branch": "main" },
  "highlight-colors": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lspconfig": { "branch": "master" },
  "mason": { "branch": "main" },
  "mason-extra-cmds": { "branch": "main" },
  "mason-lspconfig": { "branch": "main" },
  "noice": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "nui": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "orphans": { "branch": "main" },
  "schema-store": { "branch": "main" },
  "scope": { "branch": "main" },
  "snacks": { "branch": "main" },
  "surround": { "branch": "main" },
  "todo-comments": { "branch": "main" },
  "treesitter": { "branch": "master" },
  "treesitter-autotag": { "branch": "main" },
  "treesitter-context": { "branch": "master" },
  "treesitter-text-objects": { "branch": "master" },
  "ts-comments": { "branch": "main" },
  "ts-error-translator": { "branch": "main" },
  "windovigation": { "branch": "main" }
}
