{
  "autopairs": {
    "branch": "master"
  },
  "avente": {
    "branch": "main"
  },
  "catppuccin": {
    "branch": "main"
  },
  "cmp": {
    "branch": "main"
  },
  "cmp-buffer": {
    "branch": "main"
  },
  "cmp-calc": {
    "branch": "main"
  },
  "cmp-cmdline": {
    "branch": "main"
  },
  "cmp-lsp": {
    "branch": "main"
  },
  "cmp-lsp-signature-help": {
    "branch": "main"
  },
  "cmp-path": {
    "branch": "main"
  },
  "cokeline": {
    "branch": "main"
  },
  "colorizer": {
    "branch": "master"
  },
  "conform": {
    "branch": "master"
  },
  "copilot": {
    "branch": "master"
  },
  "copilot-chat": {
    "branch": "canary"
  },
  "devicons": {
    "branch": "master"
  },
  "diffview": {
    "branch": "main"
  },
  "dressing": {
    "branch": "master"
  },
  "git-worktree": {
    "branch": "master"
  },
  "gitsigns": {
    "branch": "main"
  },
  "hererocks": {
    "branch": "master"
  },
  "lazy.nvim": {
    "branch": "main"
  },
  "lspconfig": {
    "branch": "master"
  },
  "mason": {
    "branch": "main"
  },
  "mason-lspconfig": {
    "branch": "main"
  },
  "noice": {
    "branch": "main"
  },
  "noice.nvim": {
    "branch": "main"
  },
  "nui": {
    "branch": "main"
  },
  "nvim-tree": {
    "branch": "master"
  },
  "octo": {
    "branch": "master"
  },
  "plenary": {
    "branch": "master"
  },
  "plenary.nvim": {
    "branch": "master"
  },
  "render-markdown": {
    "branch": "main"
  },
  "schema-store": {
    "branch": "main"
  },
  "scope": {
    "branch": "main"
  },
  "surround": {
    "branch": "main"
  },
  "telescope": {
    "branch": "master"
  },
  "telescope-fzf-native": {
    "branch": "main"
  },
  "telescope-undo": {
    "branch": "main"
  },
  "todo-comments": {
    "branch": "main"
  },
  "treesitter": {
    "branch": "master"
  },
  "treesitter-autotag": {
    "branch": "main"
  },
  "treesitter-context": {
    "branch": "master"
  },
  "treesitter-text-objects": {
    "branch": "master"
  },
  "ts-comments": {
    "branch": "main"
  },
  "windovigation": {
    "branch": "main"
  },
  "zen-mode": {
    "branch": "main"
  }
}
