{
  "autopairs": { "branch": "master" },
  "catppuccin": { "branch": "main" },
  "cmp": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-calc": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-lsp": { "branch": "main" },
  "cmp-lsp-signature-help": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cokeline": { "branch": "main" },
  "colorizer": { "branch": "master" },
  "copilot": { "branch": "master" },
  "devicons": { "branch": "master" },
  "diffview": { "branch": "main" },
  "dressing": { "branch": "master" },
  "fugitive": { "branch": "master" },
  "gitsigns": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lspconfig": { "branch": "master" },
  "luasnip": { "branch": "master" },
  "mason": { "branch": "main" },
  "mason-lspconfig": { "branch": "main" },
  "nvim-tree": { "branch": "master" },
  "plenary": { "branch": "master" },
  "schema-store": { "branch": "main" },
  "surround": { "branch": "main" },
  "telescope": { "branch": "master" },
  "treesitter": { "branch": "master" },
  "treesitter-autotag": { "branch": "main" },
  "treesitter-context": { "branch": "master" },
  "treesitter-text-objects": { "branch": "master" },
  "undotree": { "branch": "master" },
  "windovigation": { "branch": "main" }
}